Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If the ID, access and refresh tokens are JWT tokens then combining all of them (if the strategy is the default `keep-all-tokens`) or only ID and refresh tokens (if the strategy is `id-refresh-token`) may produce a session cookie value larger than 4KB and the browsers may not be able to keep this cookie. In such cases, you can use `quarkus.oidc.token-state-manager.split-tokens=true` to have a unique session token per each of these tokens.
ja_jp: ID、アクセス、リフレッシュの各トークンが JWT トークンの場合、それらすべてを組み合わせたり (ストラテジーがデフォルトの `keep-all-tokens` の場合)、ID およびリフレッシュトークンのみ (ストラテジーが `id-refresh-token` の場合)、セッションクッキーの値が 4KB 以上になり、ブラウザーがこのクッキーを保持できない可能性があります。このような場合、 `quarkus.oidc.token-state-manager.split-tokens=true` を使用して、これらのトークンごとに一意のセッショントークンを持たせることができます。

source: If the JWT token can not be injected, for example, if it is embedded in the service request payload or the service endpoint acquires it out of band, then one can use `JWTParser`:
ja_jp: JWT トークンを挿入できない場合、たとえば、サービスリクエストペイロードに埋め込まれていたり、サービスエンドポイントが別の経路でトークンを取得する場合、 `JWTParser` を使用できます。

source: If the Kafka Dev Service is available during tests, `KafkaCompanionResource` uses the created Kafka broker, otherwise it creates a Kafka broker using https://github.com/strimzi/test-container[Strimzi Test Container].
ja_jp: テスト中に Kafka Dev Service が利用可能な場合、 `KafkaCompanionResource` は作成された Kafka ブローカーを使用します。そうでない場合は、 https://github.com/strimzi/test-container[Strimzi Test Container] を使用して Kafka ブローカーを作成します。

source: If the Keycloak container is not ready within the default 60-second timeout, you can resolve this by extending the timeout period. For instance, set it to 2 minutes with `quarkus.devservices.timeout=2M`.
ja_jp: Keycloak コンテナーがデフォルトの 60 秒のタイムアウト内に準備できない場合は、タイムアウト期間を延長することで解決できます。 たとえば、`quarkus.devservices.timeout=2M` で 2 分に設定します。

source: If the Micrometer registry you would like to use does not yet have an associated extension, use the `quarkus-micrometer` extension and bring in the Micrometer meter registry dependency directly:
ja_jp: 使用する Micrometer レジストリに関連エクステンションがない場合は、 `quarkus-micrometer` エクステンションを使用し、Micrometer メーターレジストリの依存関係を直接取り込んでください：

source: If the Micrometer registry you would like to use does not yet have an associated extension, use the `quarkus-micrometer` extension and bring in the packaged MeterRegistry dependency directly:
ja_jp: 使用したい Micrometer レジストリに関連するエクステンションがまだない場合は、 `quarkus-micrometer` エクステンションを使用して、パッケージ化された MeterRegistry の依存関係を直接取り込んでください。

source: If the NVD database flags a CVE against a Quarkus tag, a link that provides more details about the CVE is added to the given CPE name entry.
ja_jp: NVDデータベースがQuarkusタグに対してCVEフラグを立てた場合、そのCVEの詳細を提供するリンクが、指定されたCPE名エントリに追加されます。

source: If the NVE database flags a CVE against a Quarkus tag, a link that provides more details about the CVE is added to the given CPE name entry.
ja_jp: NVEデータベースがQuarkusタグに対してCVEフラグを立てた場合、CVEの詳細を提供するリンクが所定のCPE名エントリに追加されます。

source: If the Narayana JTA extension is also available, integration is automatic.
ja_jp: Narayana JTA のエクステンションも利用できる場合、統合は自動的に行われます。

source: If the Narayana LRA extension is present (`quarkus-narayana-lra`), the Dev Services for Narayana LRA coordinator automatically starts the Narayana LRA coordinator in dev mode and when running tests. So, you don't have to start it manually. The application is also configured automatically to connect to the coordinator and to make possible for the coordinator to call back the application.
ja_jp: Narayana LRA エクステンション (`quarkus-narayana-lra`) が存在する場合、Narayana LRA コーディネーター 用 Dev Services は、開発モードおよびテスト実行時に Narayana LRA コーディネーターを自動的に起動します。そのため、手動で起動する必要はありません。アプリケーションも、コーディネーターに接続し、コーディネーターがアプリケーションにコールバックできるように自動的に設定されます。

source: If the OAuth2 Authentication server provides JWT Bearer Tokens then you should consider using either xref:security-openid-connect.adoc[OpenID Connect] or xref:security-jwt.adoc[SmallRye JWT] extensions instead. OpenID Connect extension has to be used if the Quarkus application needs to authenticate the users using OIDC Authorization Code Flow, please read xref:security-openid-connect-web-authentication.adoc[Using OpenID Connect to Protect Web Applications] guide for more information.
ja_jp: OAuth2認証サーバーがJWT形式のBearer Tokensを提供する場合は、代わりに xref:security-openid-connect.adoc[OpenID Connect] または xref:security-jwt.adoc[SmallRye JWT] エクステンションの使用を検討する必要があります。QuarkusアプリケーションがOIDC認可コードフローを使用してユーザー認証する場合は、OpenID Connectエクステンションを使用する必要があります。詳しくは、xref:security-openid-connect-web-authentication.adoc[OpenID Connect を使った WEB アプリケーションの保護] をご覧ください。

source: If the OAuth2 Authentication server provides JWT Bearer Tokens, consider using either xref:security-oidc-bearer-token-authentication.adoc[OIDC Bearer token authentication] or xref:security-jwt.adoc[SmallRye JWT] extensions instead. OpenID Connect extension has to be used if the Quarkus application needs to authenticate the users using OIDC Authorization Code Flow. For more information, see the xref:security-oidc-code-flow-authentication.adoc[OIDC code flow mechanism for protecting web applications] guide.
ja_jp: OAuth2認証サーバーがJWTベアラートークンを提供する場合は、代わりに xref:security-oidc-bearer-token-authentication.adoc[OIDCベアラートークン認証] または xref:security-jwt.adoc[SmallRye JWT] エクステンションの使用を検討してください。QuarkusアプリケーションでOIDC認可コードフローを使用してユーザーを認証する必要がある場合は、OpenID Connectエクステンションを使用する必要があります。詳細については、 xref:security-oidc-code-flow-authentication.adoc[OIDCコードフローメカニズムによるWebアプリケーションの保護] ガイドを参照してください。

source: If the OIDC Health Readiness Check must be registered.
ja_jp: OIDC Health Readiness Check を登録する必要があるかどうか。

source: If the OIDC extension is enabled
ja_jp: OIDC エクステンションが有効かどうか

source: If the Quarkus OIDC extension is present, the health endpoints will be authenticated by the xref:security-oidc-bearer-token-authentication.adoc[OIDC Bearer token authentication].
ja_jp: Quarkus OIDC エクステンションが存在する場合、ヘルスエンドポイントは xref:security-oidc-bearer-token-authentication.adoc[OIDC ベアラートークン認証] によって認証されます。

source: If the RPC method accepts parameters, you can add these to the method `.dynamicUrlJsonRPCMethodName("yourJsonRPCMethodName", Map.of("parameter-name", "parameter-value))`. The RPC method lookup defaults to the extension namespace. RPC methods from other extension namespaces can be used by prefixing the method name with the namespace : `.dynamicUrlJsonRPCMethodName("otherNamespace:jsonRPCMethodName")`.
ja_jp: RPC メソッドがパラメーターを受け入れる場合、それらをメソッド `.dynamicUrlJsonRPCMethodName("yourJsonRPCMethodName", Map.of("parameter-name", "parameter-value))` に追加できます。RPC メソッドのルックアップは、デフォルトでエクステンションの名前空間になります。他のエクステンションの名前空間の RPC メソッドは、メソッド名の前に名前空間を付けて `.dynamicUrlJsonRPCMethodName("otherNamespace:jsonRPCMethodName")` のように使用できます。

source: If the `@NestedTopLevel` or `@Nested` annotation is placed on a method signature then the STM container will start a new transaction when that method is invoked and attempt to commit it when the method returns. If there is a transaction already associated with the calling thread then each of these annotations behaves slightly differently: the former annotation will always create a new top-level transaction within which the method will execute, so the enclosing transaction does not behave as a parent, i.e., the nested top-level transaction will commit or abort independently; the latter annotation will create a transaction with is properly nested within the calling transaction, i.e., that transaction acts as the parent of this newly created transaction.
ja_jp: `@NestedTopLevel` または `@Nested` アノテーションがメソッドのシグネチャーに配置されている場合、STM コンテナーは、そのメソッドが呼び出されたときに新しいトランザク ションを開始し、そのメソッドが戻ってきたときにコミットを試みます。呼び出したスレッドに既にトランザクションが関連付けられている場合、これらのアノテーションの動作はそれぞれ若干異なります。前者のアノテーションでは、メソッドが実行される新しいトップレベルのトランザクションが常に作成されるため、周囲のトランザクションは親として動作せず、入れ子になったトップレベルのトランザクションは独立してコミットまたはアボートします。後者のアノテーションでは、呼び出したトランザクションの中に適切に入れ子になったトランザクションが作成され、そのトランザクションが新しく作成されたトランザクションの親として動作します。

source: If the `ConstraintValidator` bean implements the `initialize(A constraintAnnotation)` method and depends on the state of the constraint annotation, use the `@Dependent` scope to make sure each annotation context has a separate and properly configured instance of the `ConstraintValidator` bean.
ja_jp: `ConstraintValidator` Bean が `initialize(constraintAnnotation)` メソッドを実装し、制約アノテーションの状態に依存する場合は、 `@Dependent` スコープを使用して、各アノテーション コンテキストに `ConstraintValidator Beanの個別の適切に構成されたインスタンスがあることを確認します。

source: If the `accept` header matches `text/html` we set the content type automatically.
ja_jp: `accept` ヘッダーが `text/html` と一致する場合、コンテンツタイプを自動的に設定します。

source: If the `accept` header matches `text/html`, we set the content type automatically to `text/html`.
ja_jp: `accept` ヘッダーが `text/html` と一致する場合、コンテンツタイプを自動的に `text/html` に設定します。

source: If the `address` attribute is not set, the connector uses the channel name.
ja_jp: `address` 属性が設定されていない場合、コネクターはチャネル名を使用します。

source: If the `cognito:groups` claim is present, then Quarkus will extract and map those groups to Quarkus roles which can then be used in authorization with annotations like `@RolesAllowed`. If you do not want to map `cognito:groups` to Quarkus roles, then you must explicitly disable it in configuration:
ja_jp: `cognito:groups` が存在する場合、Quarkus はこれらのグループを抽出して Quarkus のロールにマッピングし、 `@RolesAllowed` のようなアノテーションを使用して認証に使用することができます。 `cognito:groups` をQuarkusのロールにマッピングしたくない場合は、設定で明示的に無効にする必要があります:

source: If the `com.fasterxml.jackson.module:jackson-module-kotlin` dependency and the `quarkus-jackson` extension (or one of the `quarkus-resteasy-jackson` or `quarkus-rest-jackson` extensions) have been added to the project, then Quarkus automatically registers the `KotlinModule` to the `ObjectMapper` bean (see xref:rest-json.adoc#jackson[this] guide for more details).
ja_jp: `com.fasterxml.jackson.module:jackson-module-kotlin` 依存関係と `quarkus-jackson` エクステンション（または `quarkus-resteasy-jackson` または `quarkus-rest-jackson` エクステンションのいずれか）がプロジェクトに追加されている場合、Quarkus は自動的に `KotlinModule` を `ObjectMapper` Bean に登録します（詳細は xref:rest-json.adoc#jackson[この] ガイドを参照）。

source: If the `com.fasterxml.jackson.module:jackson-module-kotlin` dependency and the `quarkus-jackson` extension (or one of the `quarkus-resteasy-jackson` or `quarkus-resteasy-reactive-jackson` extensions) have been added to the project, then Quarkus automatically registers the `KotlinModule` to the `ObjectMapper` bean (see xref:rest-json.adoc#jackson[this] guide for more details).
ja_jp: `com.fasterxml.jackson.module:jackson-module-kotlin` の依存関係と `quarkus-jackson` エクステンション（または `quarkus-resteasy-jackson` や `quarkus-resteasy-reactive-jackson` エクステンションのいずれか）がプロジェクトに追加されている場合、Quarkus は `KotlinModule` から `ObjectMapper` の Bean を自動的に登録します（詳細は link:rest-json.html#jackson[この]ガイドを参照してください）。

source: If the `daysInFuture` query parameter is omitted, the three days weather forecast will start from the current day. Otherwise, it will start from the current day plus the `daysInFuture` value.
ja_jp: `daysInFuture` クエリパラメーターが省略された場合、3 日間の天気予報は現在の日から始まります。それ以外の場合は、現在の日に `daysInFuture` の値を加えたものから始まります。

source: If the `exchange.name` or `queue.name` attribute is not set, the connector uses the channel name.
ja_jp: `exchange.name` または `queue.name` 属性が設定されていない場合、コネクターはチャネル名を使用します。

source: If the `expire-after-write` is not configured, the entry won't be evicted. You would need to invalidate the values using the `@CacheInvalidateAll` or `@CacheInvalidate` annotations.
ja_jp: `expire-after-write` が構成されていない場合、エントリは退避されません。 `@CacheInvalidateAll` または `@CacheInvalidate` アノテーションを使用して値を無効にする必要があります。

source: If the `fail-on-deserialization-failure` attribute is set to `false` and the `failure-strategy` attribute is `dead-letter-queue` the failed record will be sent to the corresponding *dead letter queue* topic.
ja_jp: `fail-on-deserialization-failure` 属性が `false` に設定され、 `failure-strategy` 属性が `dead-letter-queue` の場合、失敗したレコードは対応する *デッドレターキュー* トピックに送信されます。

source: If the `group.id` attribute is not set, it defaults the `quarkus.application.name` configuration property.
ja_jp: `group.id` 属性が設定されていない場合、 `quarkus.application.name` 設定プロパティーがデフォルトになります。

source: If the `iss` property is tenant specific in a multi-tenant deployment then you can use the `SecurityIdentity` `tenant-id` attribute to check the issuer is correct in the endpoint itself or the custom JAX-RS filter, for example:
ja_jp: マルチテナント展開で `iss` プロパティがテナント固有のものである場合は、 `SecurityIdentity` `tenant-id` 属性を使用して、エンドポイント自体やカスタム JAX-RS フィルタなどでissuerが正しいかどうかを確認することができます。

source: If the `iss` property is tenant-specific in a multitenant deployment, use the `SecurityIdentity` `tenant-id` attribute to check that the issuer is correct in the endpoint or the custom Jakarta filter. For example:
ja_jp: マルチテナントデプロイメントで `iss` プロパティーがテナント固有のものである場合は、 `SecurityIdentity` `tenant-id` 属性を使用して、エンドポイントまたはカスタム Jakarta フィルターで発行者が正しいことを確認します。 以下に例を示します。

source: If the `javax.net.ssl.trustStore` system property is defined, its value is honored as a truststore.
ja_jp: `javax.net.ssl.trustStore` システムプロパティーが定義されている場合、その値はトラストストアとして尊重されます。

source: If the `key` param is not used then all clients of the template share the same cached value.
ja_jp: `key` パラメーターが使用されていない場合は、テンプレートのすべてのクライアントが同じキャッシュ値を共有します。

source: If the `quarkus-apicurio-registry-avro` extension is present, Dev Services for Apicurio Registry automatically starts an Apicurio Registry instance in dev mode and when running tests. Also, all Kafka channels in SmallRye Reactive Messaging are automatically configured to use this registry. (This automatic configuration of course only applies to serializers and deserializers from the Apicurio Registry Avro library.)
ja_jp: `quarkus-apicurio-registry-avro` エクステンションが存在する場合、Dev Services for Apicurio Registryは、開発モードやテスト実行時に自動的にApicurio Registryインスタンスを起動します。また、SmallRye Reactive MessagingのすべてのKafkaチャンネルは、このレジストリを使用するように自動的に設定されます。(もちろん、この自動設定はApicurio Registry Avroライブラリのシリアライザとデシリアライザにのみ適用されます)。

source: If the `quarkus-cache` extension is present in a Quarkus application then the `CacheSectionHelper` is registered and configured _automatically_. The name of the cache is `qute-cache`. It can be configured <<cache#configuring-the-underlying-caching-provider,in a standard way>> and even managed programmatically via `@Inject @CacheName("qute-cache") Cache`.
ja_jp: Quarkus アプリケーションに`quarkus-cache` エクステンションが存在する場合、`CacheSectionHelper` が登録され、_自動的_ に設定されます。キャッシュの名前は `qute-cache` です。これは <<cache#configuring-the-underlying-caching-provider,in a standard way>> と定義でき、`@Inject @CacheName("qute-cache") Cache` を介してプログラムで管理することもできます。

source: If the `quarkus-extension-b` dependency wasn't declared as `<optional>true</optional>` it would make the `quarkus-extension-b` a required dependency of the `quarkus-extension-a` and its dependency condition would be ignored by the application dependency resolver.
ja_jp: `quarkus-extension-b`依存関係が `<optional>true</optional>` と宣言されると、 `quarkus-extension-b` が `quarkus-extension-a` の必須依存関係となり、その依存関係条件はアプリケーション依存関係リゾルバーによって無視されます。

source: If the `quarkus-extension-b` does define a dependency condition on its own (a dependency condition recorded in its `META-INF/quarkus-extension.properties`), the `quarkus-extension-b` will be added as a dependency of the `quarkus-extension-a` in dev mode only if its condition is satisfied (the artifacts it requires are present in the application dependency graph).
ja_jp: `quarkus-extension-b` が独自に依存条件 (`META-INF/quarkus-extension.properties` に記録された依存条件) を定義している場合、その条件が満たされている (必要なアーティファクトがアプリケーション依存グラフに存在する) 場合にのみ、 `quarkus-extension-b` は開発モードで `quarkus-extension-a` の依存関係として追加されます。

source: If the `quarkus-extension-b` does not define a dependency condition on its own (there is no dependency condition recorded in its `META-INF/quarkus-extension.properties`), the `quarkus-extension-b` will only be added as a dependency of the `quarkus-extension-a` in dev mode but not in other modes (prod or test).
ja_jp: `quarkus-extension-b` が独自に依存条件を定義していない場合 (`META-INF/quarkus-extension.properties` に依存条件が記録されていない場合)、 `quarkus-extension-b` は `quarkus-extension-a` の依存関係として開発モードでのみ追加され、他のモード (prod または test) では追加されません。

source: If the `quarkus-quartz` extension is present then this method will be executed with the Quartz-specific scheduler.
ja_jp: `quarkus-quartz` エクステンションが存在する場合、このメソッドは Quartz 固有のスケジューラーで実行されます。

source: If the `quarkus.compose.devservices.project-name` property is set, it's used as the project name
ja_jp: `quarkus.compose.devservices.project-name` プロパティーが設定されている場合、それがプロジェクト名として使用されます。

source: If the `quarkus.jaeger.service-name` property (or `JAEGER_SERVICE_NAME` environment variable) is not provided then a "no-op" tracer will be configured, resulting in no tracing data being reported to the backend.
ja_jp: `quarkus.jaeger.service-name` プロパティー (または `JAEGER_SERVICE_NAME` 環境変数) が提供されていない場合は、"no-op" トレーサーが設定され、結果としてトレースデータはバックエンドに報告されません。

source: If the `quarkus.oidc.authentication.user-info-required` property is set to `true`, the application requires that an access token is used to request `UserInfo`. In that case, you must add the `scope=openid` query parameter to the token grant request; for example:
ja_jp: `quarkus.oidc.authentication.user-info-required` プロパティーが `true` に設定されている場合、アプリケーションはアクセストークンを使用して UserInfo をリクエストすることを要求します。 その場合、トークン付与リクエストに `scope=openid` クエリーパラメーターを追加する必要があります。以下に例を示します。

source: If the `quarkus.oidc.logout.post-logout-path` is set then a `q_post_logout` cookie will be created and a matching `state` query parameter will be added to the logout redirect URI and the OpenID Connect Provider will return this `state` once the logout has been completed. It is recommended for the Quarkus `web-app` applications to check that a `state` query parameter matches the value of the `q_post_logout` cookie which can be done for example in a JAX-RS filter.
ja_jp: `quarkus.oidc.logout.post-logout-path` が設定されている場合、 `q_post_logout` Cookie が作成され、一致する `state` クエリーパラメーターがログアウトリダイレクト URI に追加されます。ログアウトが完了すると、OpenID Connect プロバイダーはこの `state` を返します。Quarkus の `web-app` アプリケーションでは、 `state` クエリーパラメーターが `q_post_logout` cookie の値と一致することを確認することをお勧めします。これは、たとえば JAX-RS フィルターで実行できます。

source: If the `quarkus.oidc.logout.post-logout-path` is set then a `q_post_logout` cookie will be created and a matching `state` query parameter will be added to the logout redirect URI and the OpenID Connect Provider will return this `state` once the logout has been completed. It is recommended for the Quarkus `web-app` applications to check that a `state` query parameter matches the value of the `q_post_logout` cookie which can be done for example in a Jakarta REST filter.
ja_jp: `quarkus.oidc.logout.post-logout-path` が設定されている場合、 `q_post_logout` Cookie が作成され、それに一致する `state` クエリパラメータがログアウトリダイレクト URI に追加され、ログアウトが完了すると OpenID Connect プロバイダはこの `state` を返します。Quarkus `web-app` アプリケーションでは、 `state` クエリパラメータが `q_post_logout` Cookie の値と一致するかどうかを確認することが推奨されます。これは、例えば Jakarta REST フィルタで実行できます。

source: If the `quarkus.oidc.logout.post-logout-path` is set, then a `q_post_logout` cookie will be created and a matching `state` query parameter will be added to the logout redirect URI and the OIDC provider will return this `state` once the logout has been completed. It is recommended for the Quarkus `web-app` applications to check that a `state` query parameter matches the value of the `q_post_logout` cookie, which can be done, for example, in a Jakarta REST filter.
ja_jp: `quarkus.oidc.logout.post-logout-path` が設定されている場合、 `q_post_logout` クッキーが作成され、一致する `state` クエリーパラメーターがログアウトリダイレクト URI に追加され、ログアウトが完了すると OIDC プロバイダーはこの `state` を返します。 Quarkus の `web-app` アプリケーションでは、 `state` クエリーパラメーターが `q_post_logout` クッキーの値と一致することを確認することを推奨します。これは、たとえば Jakarta REST フィルターで実行できます。

source: If the `quarkus.oidc.logout.post-logout-path` is set, then a `q_post_logout` cookie will be created, and a matching `state` query parameter will be added to the logout redirect URI, and the OIDC provider will return this `state` once the logout has been completed. It is recommended that Quarkus `web-app` applications verify that a `state` query parameter matches the value of the `q_post_logout` cookie, for example, in a Jakarta REST filter.
ja_jp: `quarkus.oidc.logout.post-logout-path` が設定されている場合、 `q_post_logout` Cookie が作成され、それに一致する `state` クエリーパラメーターがログアウトリダイレクト URI に追加されます。ログアウトが完了すると、OIDC プロバイダーはこの `state` を返します。 Quarkus `web-app` アプリケーションでは、`state` クエリーパラメーターが `q_post_logout` Cookie の値と一致することを確認することをお勧めします。これは、たとえば Jakarta REST フィルターで実行できます。

source: If the `quarkus.oidc.roles.role-claim-path` property is set, and matching array or string claims are found, then the roles are extracted from these claims. For example, `customroles`, `customroles/array`, `scope`, `"http://namespace-qualified-custom-claim"/roles`, `"http://namespace-qualified-roles"`.
ja_jp: `quarkus.oidc.roles.role-claim-path` プロパティーが設定されており、一致する配列または文字列のクレームが見つかった場合、そのクレームからロールが抽出されます。 たとえば、 `customroles`、 `customroles/array`、 `scope`、 `"http://namespace-qualified-custom-claim"/roles`、 `"http://namespace-qualified-roles"` などです。

source: If the `quarkus.oidc.token.refresh-expired` is set to `true`, then the expired ID token (and the access token) is refreshed by using the refresh token returned with the initial authorization code grant response. This refresh token might also be recycled (refreshed) itself as part of this process. As a result, the new session cookie is created, and the session is extended.
ja_jp: `quarkus.oidc.token.refresh-expired` が `true` に設定されている場合、期限切れの ID トークン (およびアクセストークン) は、初期認可コード付与応答で返されたリフレッシュトークンを使用して更新されます。 このリフレッシュトークンも、このプロセスの一環としてリサイクル (リフレッシュ) される可能性があります。 その結果、新しいセッションクッキーが作成され、セッションが延長されます。

source: If the `quarkus.oidc.token.refresh-expired` then the expired ID token (as well as the access token) will be refreshed using the refresh token returned with the authorization code grant response. This refresh token may also be recycled (refreshed) itself as part of this process. As a result the new session cookie will be created and the session will be extended.
ja_jp: `quarkus.oidc.token.refresh-expired` を指定すると、認可コード付与応答で返されたリフレッシュトークンを使用して、期限切れの ID トークン (アクセストークンも含む) がリフレッシュされます。このリフレッシュトークンは、このプロセスの一部としてリサイクル (リフレッシュ) されることもあります。その結果、新しいセッションクッキーが作成され、セッションが延長されます。

source: If the `smallrye.jwt.sign.key.location` or `smallrye.jwt.encrypt.key.location` properties are set, you can secure existing claims, such as resources, maps, JsonObjects, with a single call:
ja_jp: `smallrye.jwt.sign.key.location` または `smallrye.jwt.encrypt.key.location` プロパティーが設定されている場合は、リソース、マップ、JsonObject などの既存のクレームを 1 回の呼び出しで保護できます。

source: If the access token contains the roles and this access token is not meant to be propagated to the downstream endpoints, then set `quarkus.oidc.roles.source=accesstoken`.
ja_jp: アクセストークンにロールが含まれており、このアクセストークンがダウンストリームエンドポイントに伝播されることを意図していない場合は、 `quarkus.oidc.roles.source=accesstoken` を設定します。

source: If the access token needs to be refreshed but no refresh token is available then an attempt will be made to acquire a new token using the configured grant such as `client_credentials`.
ja_jp: アクセストークンの更新が必要なのにリフレッシュトークンがない場合は、 `client_credentials` のように設定されたグラントを使って新しいトークンの取得を試みます。

source: If the access token needs to be refreshed but no refresh token is available, an attempt is made to acquire a new token with a configured grant, such as `client_credentials`.
ja_jp: アクセストークンの更新が必要なのにリフレッシュトークンがない場合は、 `client_credentials` のように設定されたグラントを使って新しいトークンの取得を試みます。

source: If the access token needs to be refreshed, but no refresh token is available, then an attempt is made to acquire a new token by using a configured grant, such as `client_credentials`.
ja_jp: アクセストークンの更新が必要なのにリフレッシュトークンがない場合は、 `client_credentials` のように設定されたグラントを使って新しいトークンの取得を試みます。

source: If the amount is not in hundreds, it could be a problem. A possible workaround is to compromise, acceptable for testing, and set:
ja_jp: 量が百単位でない場合、問題になる可能性があります。回避策として考えられるのは、テストでは許容される妥協をし、次のように設定することです:
